#32: Plotting dari suatu Pandas Data Frame

Bryan Nicholas - 2273009

Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.3
1.26.2

Persiapan Data Frame

In [2]:
n_rows = 40
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df.head()

    A   B   C   D   E
0   9  14   2  19  10
1   3   6   5  11   1
2  18   4  18   2  12
3   3   5  15  13  11
4  14   7  13   7   2

Line Plot

In [3]:
df.head()

    A   B   C   D   E
0   9  14   2  19  10
1   3   6   5  11   1
2  18   4  18   2  12
3   3   5  15  13  11
4  14   7  13   7   2

In [ ]:
df.plot(kind='line')

In [ ]:
df[['A', 'B']].plot(kind='line')

Bar Plot

In [6]:
df.head()

    A   B   C   D   E
0   9  14   2  19  10
1   3   6   5  11   1
2  18   4  18   2  12
3   3   5  15  13  11
4  14   7  13   7   2

In [ ]:
df.plot(kind='bar')

In [ ]:
df[['A', 'B']].plot(kind='bar')

In [ ]:
df[['A', 'B']].head().plot(kind='bar')

In [ ]:
df[['A', 'B']].head().plot(kind='barh')

Area Plot

In [7]:
df.head()

    A   B   C   D   E
0   9  14   2  19  10
1   3   6   5  11   1
2  18   4  18   2  12
3   3   5  15  13  11
4  14   7  13   7   2

In [ ]:
df.plot(kind='area')

In [ ]:
df[['A', 'B']].head().plot(kind='area')

Box Plot

In [8]:
df.head()

    A   B   C   D   E
0   9  14   2  19  10
1   3   6   5  11   1
2  18   4  18   2  12
3   3   5  15  13  11
4  14   7  13   7   2

In [ ]:
df.plot(kind='box')

Histogram

In [9]:
df.head()

    A   B   C   D   E
0   9  14   2  19  10
1   3   6   5  11   1
2  18   4  18   2  12
3   3   5  15  13  11
4  14   7  13   7   2

In [ ]:
df.plot(kind='hist')

In [ ]:
df[['A', 'B']].plot(kind='hist')

Kernel Density Estimation (KDE)

In [10]:
df.head()

    A   B   C   D   E
0   9  14   2  19  10
1   3   6   5  11   1
2  18   4  18   2  12
3   3   5  15  13  11
4  14   7  13   7   2

In [ ]:
df.plot(kind='kde')

Scatter Plot

In [11]:
df.head()

    A   B   C   D   E
0   9  14   2  19  10
1   3   6   5  11   1
2  18   4  18   2  12
3   3   5  15  13  11
4  14   7  13   7   2

In [ ]:
df.plot(x='A', y='B', kind='scatter')